-- liquibase formatted sql

--changeset Alex:04

INSERT INTO service_points (id, name, airport_id, contact_phone, is_active) OVERRIDING SYSTEM VALUE VALUES
    (1, 'Кафе «Небо»', 1, '+7 (495) 123-45-01', TRUE),
    (2, 'Кофейня «Высота»', 1, '+7 (495) 123-45-02', TRUE),
    (3, 'Бистро «Полёт»', 2, '+7 (495) 234-56-01', TRUE),
    (4, 'Кафе «Терминал»', 2, '+7 (495) 234-56-02', FALSE),
    (5, 'Кафе «Север»', 3, '+7 (812) 345-67-01', TRUE),
    (6, 'Снек-бар «Пулково»', 3, '+7 (812) 345-67-02', TRUE),
    (7, 'Кафе «Казань»', 4, '+7 (843) 456-78-01', TRUE),
    (8, 'Кофейня «Урал»', 5, '+7 (343) 567-89-01', TRUE),
    (9, 'Кафе «Черноморье»', 6, '+7 (862) 678-90-01', TRUE),
    (10, 'Бистро «Восток»', 7, '+7 (423) 789-01-01', TRUE),
    (11, 'Кафе «Дон»', 8, '+7 (863) 111-22-01', TRUE),
    (12, 'Кофейня «Юг»', 9, '+7 (861) 222-33-01', TRUE),
    (13, 'Бистро «Сибирь»', 10, '+7 (383) 333-44-01', TRUE),
    (14, 'Кафе «Башкирия»', 11, '+7 (347) 444-55-01', TRUE),
    (15, 'Снек-бар «Волга»', 12, '+7 (831) 555-66-01', TRUE),
    (16, 'Кафе «Кавказ»', 13, '+7 (879) 666-77-01', TRUE),
    (17, 'Кофейня «Самара»', 14, '+7 (846) 777-88-01', TRUE),
    (18, 'Кафе «Транзит»', 8, '+7 (863) 111-22-02', TRUE),
    (19, 'Бистро «Кубань»', 9, '+7 (861) 222-33-02', FALSE),
    (20, 'Кафе «Ночной рейс»', 1, '+7 (495) 123-45-03', TRUE),
    (21, 'Системное начисления', 214, null, TRUE);

SELECT setval(pg_get_serial_sequence('service_points', 'id'), (SELECT MAX(id) FROM service_points));
